"""
релации

релационни база данни:
– организирани, структурирани
- в една таблица да държим всичко необходимо за едно приложение
- данните не трябва да се повтарят (нормализиране)

- база данни -  дава голяма стая с много място, където се разполагат схемите
- схема групира и организира таблиците
- таблиците организират информацията ни


- в една схема може да има различни таблици

workbench - дава визуална представ как изграждаме схемите.
може и през конзолата, но е по трудно

- таблицата може да я оприличим на Клас,
атрибутите са колоните
редовете са инстанциите

primary key - еднозначо идентифицира (ID) точно тази
autoincrement - казва ме му с каква стъпка да нарастват ID-та.
Предпазва от дупки, повторения, последователност


PK - PRIMARY KEY
NN - NOT NUL ЗАДЪЛЖИТЕЛНО ИЗИСКВА ДА БЪДЕ ПОПЪЛНЕНО
UQ - UNIQUE
ZF - ZERO FILS - ПОПЪЛВА АВТОАМАТИЧНО 0 АКО Е ПРАЗНО
AI - АВТОМАТИЧНО ПОПЪЛВА КЛЮЧОВЕТ

"""