"Data Base Management System"   # софтуера, с който работим. Изпълнява инструкции и връща резултат


"""
Видове бази данни 
NoSQL - не работи с SQL езика, съвсем различна бира
Relational - съхранпва инфото в таблици с връзки (релации) между тях
работят с езика SQL - Structured Query Language


– организирани, структурирани
- в една таблица да държим всичко необходимо за едно приложение
- данните не трябва да се повтарят (нормализиране)

- база данни -  дава голяма стая с много място, където се разполагат схемите
- схема групира и организира таблиците
- таблиците организират информацията ни


- в една схема може да има различни таблици

workbench - дава визуална представ как изграждаме схемите.
може и през конзолата, но е по трудно

- таблицата може да я оприличим на Клас,
атрибутите са колоните
редовете са инстанциите

primary key - еднозначо идентифицира (ID) точно тази
autoincrement - казва ме му с каква стъпка да нарастват ID-та.
Предпазва от дупки, повторения, последователност



MySQL Workbench

PK - PRIMARY KEY
NN - NOT NUL (None)ЗАДЪЛЖИТЕЛНО ИЗИСКВА ДА БЪДЕ ПОПЪЛНЕНО
UQ - UNIQUE
ZF - ZERO FILlL - ПОПЪЛВА АВТОАМАТИЧНО 0 АКО Е ПРАЗНО
AI - auto increment - АВТОМАТИЧНО ПОПЪЛВА КЛЮЧОВЕТ

Foreign key - слага се на подчинената таблица. Една компания има много служители. Служителите има FK


varchar(100) - стринг с определена дължина

интегритет - подсигурява на няколко нива че данните са правилни

reverce ingenering  - от SQL в таблица

forward ingenere - от таблица в my SQL

indexes - индексиране - осигурява по-бръз достъп до

Drop Table          -трие таблицата

Trunkate Table      - трие информацията в таблицата


"""


