def sum_list(num_list):
    if num_list == []:  # лист == 0, не се налага пресмятане
        return 0        # отговорът е известен

          # първия елемент + сумата на всички останали елементи
    return num_list[0] + sum_list(num_list[1:])

nums = [1, 2, 3, 4, 5]
print(sum_list(nums))


    # get_num = num_list[0]
    # bottom = sum_list_el(num_list[1:])
    # result = get_num + bottom
    # return result

    # get_num минава през всеки елемент и се опитва да го събере с нещо
    # когато стигне дъното започва да го събира с 0

    # върни 1 + нещо
    # нещото е == 2 + нещо
    # нещото е == 3 + нещо
    # нещото е == 4 + нещо
    # нещото е == 5 + нещо
    # нещото е == 0     когато лист е празен не се налага пресмятане

    # 5 + 0 = 5
    # 4 + 5 = 9
    # 3 + 9 = 12
    # 2 + 12 = 14
    # 1 + 14 = 15.






