"STRUCTURES"   # структури


"""
MVC architecture  - ПОДХОД ЗА СТРУЦТУРИРАНЕ НА КОДА един от дизайн патърна
създава струцтура и организация и разделяне 

model       - начина по който сме създали класа, какви функционалности, как се ползват и взаимодействат моделите

view        - начина на представяне на инфото към клиента - уеб стра или апп, приложение 
controller  - грижи се за обработката на заявките от и към клиента. препраща към часта от кода която трябва

routers  се грижи за обработка на рикуеста

MODELS  - не са точно копие на базата данни
    ще ползваме N layer - структурата 

VIEW    - може да върнем не само json, но и HTML -  jinja 2. В питонския код може да се вгради. Прави графиката има готови темплейти за html 


N-Tire Architecture

tier    - физическо разделение на програмата на различни сървъри
отделен физически процес - на различни машини, работещи самостоятелно 
separation of concense - разделение на 



Presentation tier   - HTTP server, HTML response, графичен интерфейс (GUI)
                    мобиле апп, Postman, за визуализиране на инфото

Logic tire  - приложение на FastAPI, прави логиката. Тук са леърите:
 приема заявката, 
    1. routes - application layer- framework-specific HTTP
    2. Service layer    - логиката какви данни искаме да вземем от БД
    3. Data access      - дава АПИ


Data tier   - 



layer   - абстрактно разделение






"""


