"БАЗА ДАННИ"    #


"""
В базата данни данните са:
– организирани
- валидирани
- в една таблица да държим всичко необходимо за едно приложение
- не се повтарят (нормализиране)


- база данни - голяма стая с много място, където се разполагат схемите
- схема групира и организира таблиците
- таблиците организират информацията ни
- в една схема може да има различни таблици

workbench - дава визуална представ как изграждаме схемите.


primary key - еднозначо идентифицира (ID) точно тази
autoincrement - казва ме му с каква стъпка да нарастват ID-та.
Предпазва от дупки, повторения, последователност
PK - PRIMARY KEY
NN - NOT NUL ЗАДЪЛЖИТЕЛНО ИЗИСКВА ДА БЪДЕ ПОПЪЛНЕНО
UQ - UNIQUE
ZF - ZERO FILS - ПОПЪЛВА АВТОАМАТИЧНО 0 АКО Е ПРАЗНО
AI - АВТОМАТИЧНО ПОПЪЛВА КЛЮЧОВЕТ
"""