"FASTAPI"     # https://fastapi.tiangolo.com/tutorial/first-steps/m


"""
В контекста на FastAPI и разработката на API, ключовата дума "async" 
(асинхронно) се използва за обозначаване на асинхронни функции и операции. 
FastAPI позволява създаването на асинхронни API, които могат да се справят с 
паралелни заявки по-ефективно.

Асинхронната програмиране позволява на приложението ви да извършва различни задачи паралелно, 
без да блокира изпълнението на други задачи. Това е особено полезно при работа със задачи, 
които изискват изчакване на дълги операции, като например извикване на външни API, 
достъп до база данни или обработка на големи файлове.

В FastAPI, за да декларирате асинхронен API маршрут или функция, 
използвайте ключовата дума async преди декларацията на функцията. 
Например:

from fastapi import FastAPI

app = FastAPI()

@app.get("/async_endpoint")
async def async_endpoint():
    # Асинхронна логика тук
    result = await some_async_function()
    return {"result": result}

"""